; domain
(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates (at ?x - rover ?y - waypoint)
             (at_lander ?x - lander ?y - waypoint)
             (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	     (equipped_for_soil_analysis ?r - rover)
             (equipped_for_rock_analysis ?r - rover)
             (equipped_for_imaging ?r - rover)
             (empty ?s - store)
             (have_rock_analysis ?r - rover ?w - waypoint)
             (have_soil_analysis ?r - rover ?w - waypoint)
             (full ?s - store)
	     (calibrated ?c - camera ?r - rover)
	     (supports ?c - camera ?m - mode)
             (available ?r - rover)
             (visible ?w - waypoint ?p - waypoint)
             (have_image ?r - rover ?o - objective ?m - mode)
             (communicated_soil_data ?w - waypoint)
             (communicated_rock_data ?w - waypoint)
             (communicated_image_data ?o - objective ?m - mode)
	     (at_soil_sample ?w - waypoint)
	     (at_rock_sample ?w - waypoint)
             (visible_from ?o - objective ?w - waypoint)
	     (store_of ?s - store ?r - rover)
	     (calibration_target ?i - camera ?o - objective)
	     (on_board ?i - camera ?r - rover)
	     (channel_free ?l - lander))


(:action navigate
:parameters (?param_1 - rover ?param_2 - waypoint ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_2)
)
:effect (and (at ?param_1 ?param_3) (not (at ?param_1 ?param_2))))

(:action sample_soil
:parameters (?param_1 - rover ?param_2 - store ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_3) (at_soil_sample ?param_3) (empty ?param_2) (equipped_for_soil_analysis ?param_1) (store_of ?param_2 ?param_1)
)
:effect (and (full ?param_2) (have_soil_analysis ?param_1 ?param_3) (not (empty ?param_2)) (not (at_soil_sample ?param_3))))

(:action sample_rock
:parameters (?param_1 - rover ?param_2 - store ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_3) (at_rock_sample ?param_3) (empty ?param_2) (equipped_for_rock_analysis ?param_1) (store_of ?param_2 ?param_1)
)
:effect (and (have_rock_analysis ?param_1 ?param_3) (full ?param_2) (not (empty ?param_2)) (not (at_rock_sample ?param_3))))

(:action drop
:parameters (?param_1 - rover ?param_2 - store)
:precondition (and
		(full ?param_2) (store_of ?param_2 ?param_1)
)
:effect (and (empty ?param_2) (not (full ?param_2))))

(:action calibrate 
:parameters (?param_1 - rover ?param_2 - camera ?param_3 - objective ?param_4 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (calibration_target ?param_2 ?param_3) (on_board ?param_2 ?param_1) (visible_from ?param_3 ?param_4)
)
:effect (and (calibrated ?param_2 ?param_1) ))

(:action take_image 
:parameters (?param_1 - rover ?param_2 - waypoint ?param_3 - objective ?param_4 - camera ?param_5 - mode) 
:precondition (and
		(at ?param_1 ?param_2) (calibrated ?param_4 ?param_1) (supports ?param_4 ?param_5) (visible_from ?param_3 ?param_2)
)
:effect (and (have_image ?param_1 ?param_3 ?param_5) (not (calibrated ?param_4 ?param_1))))

(:action communicate_soil_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - waypoint ?param_4 - waypoint ?param_5 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (at_lander ?param_2 ?param_5) (have_soil_analysis ?param_1 ?param_3)
)
:effect (and (communicated_soil_data ?param_3) ))

(:action communicate_rock_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - waypoint ?param_4 - waypoint ?param_5 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (at_lander ?param_2 ?param_5) (have_rock_analysis ?param_1 ?param_3)
)
:effect (and (communicated_rock_data ?param_3) ))

(:action communicate_image_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - objective ?param_4 - mode ?param_5 - waypoint ?param_6 - waypoint) 
:precondition (and
		(at ?param_1 ?param_5) (at_lander ?param_2 ?param_6) (have_image ?param_1 ?param_3 ?param_4)
)
:effect (and (communicated_image_data ?param_3 ?param_4) ))
)

; problem
(define (problem rover-96)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 rover4 - rover
    rover1store rover2store rover3store rover4store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 waypoint10 - waypoint
    camera1 camera2 camera3 camera4 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 objective8 objective9 objective10 - objective)
 (:init 
    (at_lander general waypoint6)
    (at rover1 waypoint6)
    (at rover2 waypoint9)
    (at rover3 waypoint2)
    (at rover4 waypoint7)
    (equipped_for_soil_analysis rover4)
    (equipped_for_rock_analysis rover2)
    (equipped_for_rock_analysis rover4)
    (equipped_for_imaging rover2)
    (equipped_for_imaging rover1)
    (equipped_for_imaging rover3)
    (equipped_for_imaging rover4)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (empty rover4store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (store_of rover4store rover4)
    (at_rock_sample waypoint1)
    (at_rock_sample waypoint2)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint4)
    (at_rock_sample waypoint6)
    (at_rock_sample waypoint8)
    (at_rock_sample waypoint9)
    (at_soil_sample waypoint3)
    (at_soil_sample waypoint4)
    (at_soil_sample waypoint5)
    (at_soil_sample waypoint6)
    (at_soil_sample waypoint7)
    (at_soil_sample waypoint9)
    (visible waypoint9 waypoint10)
    (visible waypoint7 waypoint4)
    (visible waypoint10 waypoint5)
    (visible waypoint6 waypoint2)
    (visible waypoint2 waypoint8)
    (visible waypoint6 waypoint5)
    (visible waypoint6 waypoint1)
    (visible waypoint3 waypoint2)
    (visible waypoint5 waypoint7)
    (visible waypoint2 waypoint3)
    (visible waypoint5 waypoint10)
    (visible waypoint2 waypoint6)
    (visible waypoint5 waypoint6)
    (visible waypoint10 waypoint9)
    (visible waypoint1 waypoint6)
    (visible waypoint7 waypoint5)
    (visible waypoint4 waypoint7)
    (visible waypoint8 waypoint2)
    (visible waypoint4 waypoint8)
    (visible waypoint8 waypoint4)
    (visible waypoint3 waypoint4)
    (visible waypoint4 waypoint3)
    (visible waypoint6 waypoint7)
    (visible waypoint7 waypoint6)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (can_traverse rover1 waypoint9 waypoint10)
    (can_traverse rover1 waypoint7 waypoint4)
    (can_traverse rover1 waypoint10 waypoint5)
    (can_traverse rover1 waypoint6 waypoint2)
    (can_traverse rover1 waypoint2 waypoint8)
    (can_traverse rover1 waypoint6 waypoint5)
    (can_traverse rover1 waypoint6 waypoint1)
    (can_traverse rover1 waypoint3 waypoint2)
    (can_traverse rover1 waypoint5 waypoint7)
    (can_traverse rover1 waypoint2 waypoint3)
    (can_traverse rover1 waypoint5 waypoint10)
    (can_traverse rover1 waypoint2 waypoint6)
    (can_traverse rover1 waypoint5 waypoint6)
    (can_traverse rover1 waypoint10 waypoint9)
    (can_traverse rover1 waypoint1 waypoint6)
    (can_traverse rover1 waypoint7 waypoint5)
    (can_traverse rover1 waypoint4 waypoint7)
    (can_traverse rover1 waypoint8 waypoint2)
    (can_traverse rover2 waypoint9 waypoint10)
    (can_traverse rover2 waypoint7 waypoint4)
    (can_traverse rover2 waypoint10 waypoint5)
    (can_traverse rover2 waypoint6 waypoint2)
    (can_traverse rover2 waypoint2 waypoint8)
    (can_traverse rover2 waypoint6 waypoint5)
    (can_traverse rover2 waypoint6 waypoint1)
    (can_traverse rover2 waypoint3 waypoint2)
    (can_traverse rover2 waypoint5 waypoint7)
    (can_traverse rover2 waypoint2 waypoint3)
    (can_traverse rover2 waypoint5 waypoint10)
    (can_traverse rover2 waypoint2 waypoint6)
    (can_traverse rover2 waypoint5 waypoint6)
    (can_traverse rover2 waypoint10 waypoint9)
    (can_traverse rover2 waypoint1 waypoint6)
    (can_traverse rover2 waypoint7 waypoint5)
    (can_traverse rover2 waypoint4 waypoint7)
    (can_traverse rover2 waypoint8 waypoint2)
    (can_traverse rover2 waypoint4 waypoint8)
    (can_traverse rover2 waypoint8 waypoint4)
    (can_traverse rover2 waypoint3 waypoint4)
    (can_traverse rover2 waypoint4 waypoint3)
    (can_traverse rover3 waypoint9 waypoint10)
    (can_traverse rover3 waypoint7 waypoint4)
    (can_traverse rover3 waypoint10 waypoint5)
    (can_traverse rover3 waypoint6 waypoint2)
    (can_traverse rover3 waypoint2 waypoint8)
    (can_traverse rover3 waypoint6 waypoint5)
    (can_traverse rover3 waypoint6 waypoint1)
    (can_traverse rover3 waypoint3 waypoint2)
    (can_traverse rover3 waypoint5 waypoint7)
    (can_traverse rover3 waypoint2 waypoint3)
    (can_traverse rover3 waypoint5 waypoint10)
    (can_traverse rover3 waypoint2 waypoint6)
    (can_traverse rover3 waypoint5 waypoint6)
    (can_traverse rover3 waypoint10 waypoint9)
    (can_traverse rover3 waypoint1 waypoint6)
    (can_traverse rover3 waypoint7 waypoint5)
    (can_traverse rover3 waypoint4 waypoint7)
    (can_traverse rover3 waypoint8 waypoint2)
    (can_traverse rover4 waypoint9 waypoint10)
    (can_traverse rover4 waypoint7 waypoint4)
    (can_traverse rover4 waypoint10 waypoint5)
    (can_traverse rover4 waypoint6 waypoint2)
    (can_traverse rover4 waypoint2 waypoint8)
    (can_traverse rover4 waypoint6 waypoint5)
    (can_traverse rover4 waypoint6 waypoint1)
    (can_traverse rover4 waypoint3 waypoint2)
    (can_traverse rover4 waypoint5 waypoint7)
    (can_traverse rover4 waypoint2 waypoint3)
    (can_traverse rover4 waypoint5 waypoint10)
    (can_traverse rover4 waypoint2 waypoint6)
    (can_traverse rover4 waypoint5 waypoint6)
    (can_traverse rover4 waypoint10 waypoint9)
    (can_traverse rover4 waypoint1 waypoint6)
    (can_traverse rover4 waypoint7 waypoint5)
    (can_traverse rover4 waypoint4 waypoint7)
    (can_traverse rover4 waypoint8 waypoint2)
    (can_traverse rover4 waypoint4 waypoint8)
    (can_traverse rover4 waypoint8 waypoint4)
    (calibration_target camera1 objective10)
    (on_board camera1 rover1)
    (supports camera1 colour)
    (supports camera1 low_res)
    (calibration_target camera2 objective4)
    (on_board camera2 rover2)
    (supports camera2 high_res)
    (supports camera2 colour)
    (supports camera2 low_res)
    (calibration_target camera3 objective3)
    (on_board camera3 rover3)
    (supports camera3 high_res)
    (supports camera3 low_res)
    (supports camera3 colour)
    (calibration_target camera4 objective3)
    (on_board camera4 rover4)
    (supports camera4 high_res)
    (supports camera4 colour)
    (visible_from objective1 waypoint3)
    (visible_from objective2 waypoint2)
    (visible_from objective2 waypoint6)
    (visible_from objective3 waypoint9)
    (visible_from objective3 waypoint5)
    (visible_from objective3 waypoint3)
    (visible_from objective4 waypoint7)
    (visible_from objective4 waypoint10)
    (visible_from objective4 waypoint9)
    (visible_from objective5 waypoint2)
    (visible_from objective5 waypoint4)
    (visible_from objective6 waypoint5)
    (visible_from objective6 waypoint6)
    (visible_from objective6 waypoint9)
    (visible_from objective6 waypoint3)
    (visible_from objective6 waypoint2)
    (visible_from objective6 waypoint7)
    (visible_from objective6 waypoint1)
    (visible_from objective6 waypoint10)
    (visible_from objective6 waypoint8)
    (visible_from objective6 waypoint4)
    (visible_from objective7 waypoint3)
    (visible_from objective7 waypoint4)
    (visible_from objective7 waypoint10)
    (visible_from objective7 waypoint1)
    (visible_from objective7 waypoint7)
    (visible_from objective7 waypoint8)
    (visible_from objective8 waypoint8)
    (visible_from objective8 waypoint5)
    (visible_from objective8 waypoint10)
    (visible_from objective8 waypoint9)
    (visible_from objective9 waypoint10)
    (visible_from objective9 waypoint9)
    (visible_from objective9 waypoint8)
    (visible_from objective9 waypoint7)
    (visible_from objective9 waypoint3)
    (visible_from objective9 waypoint1)
    (visible_from objective9 waypoint5)
    (visible_from objective9 waypoint4)
    (visible_from objective9 waypoint6)
    (visible_from objective10 waypoint7)
    (visible_from objective10 waypoint8))
 (:goal (and 
(communicated_soil_data waypoint5)
(communicated_soil_data waypoint9)
(communicated_rock_data waypoint3)
(communicated_rock_data waypoint1)
(communicated_rock_data waypoint9)
(communicated_rock_data waypoint4)
(communicated_rock_data waypoint2)
(communicated_rock_data waypoint6)
(communicated_rock_data waypoint8)
(communicated_image_data objective1 colour)
))
)

; plan
1. (navigate rover4 waypoint7 waypoint5)
   deleted: (at rover4 waypoint7)
   added: (at rover4 waypoint5)
   goals met: 0 of 10
2. (navigate rover4 waypoint5 waypoint10)
   deleted: (at rover4 waypoint5)
   added: (at rover4 waypoint10)
   goals met: 0 of 10
3. (navigate rover4 waypoint10 waypoint9)
   deleted: (at rover4 waypoint10)
   added: (at rover4 waypoint9)
   goals met: 0 of 10
4. (sample_soil rover4 rover4store waypoint9)
   deleted: (empty rover4store) (at_soil_sample waypoint9)
   added: (full rover4store) (have_soil_analysis rover4 waypoint9)
   goals met: 0 of 10
5. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 0 of 10
6. (sample_rock rover4 rover4store waypoint9)
   deleted: (empty rover4store) (at_rock_sample waypoint9)
   added: (have_rock_analysis rover4 waypoint9) (full rover4store)
   goals met: 0 of 10
7. (navigate rover4 waypoint9 waypoint10)
   deleted: (at rover4 waypoint9)
   added: (at rover4 waypoint10)
   goals met: 0 of 10
8. (navigate rover4 waypoint10 waypoint5)
   deleted: (at rover4 waypoint10)
   added: (at rover4 waypoint5)
   goals met: 0 of 10
9. (communicate_soil_data rover4 general waypoint9 waypoint5 waypoint6)
   added: (communicated_soil_data waypoint9)
   goals met: 1 of 10
10. (communicate_rock_data rover4 general waypoint9 waypoint5 waypoint6)
   added: (communicated_rock_data waypoint9)
   goals met: 2 of 10
11. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 2 of 10
12. (sample_soil rover4 rover4store waypoint5)
   deleted: (empty rover4store) (at_soil_sample waypoint5)
   added: (full rover4store) (have_soil_analysis rover4 waypoint5)
   goals met: 2 of 10
13. (navigate rover4 waypoint5 waypoint7)
   deleted: (at rover4 waypoint5)
   added: (at rover4 waypoint7)
   goals met: 2 of 10
14. (communicate_soil_data rover4 general waypoint5 waypoint7 waypoint6)
   added: (communicated_soil_data waypoint5)
   goals met: 3 of 10
15. (navigate rover4 waypoint7 waypoint4)
   deleted: (at rover4 waypoint7)
   added: (at rover4 waypoint4)
   goals met: 3 of 10
16. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 3 of 10
17. (sample_rock rover4 rover4store waypoint4)
   deleted: (empty rover4store) (at_rock_sample waypoint4)
   added: (have_rock_analysis rover4 waypoint4) (full rover4store)
   goals met: 3 of 10
18. (navigate rover4 waypoint4 waypoint8)
   deleted: (at rover4 waypoint4)
   added: (at rover4 waypoint8)
   goals met: 3 of 10
19. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 3 of 10
20. (sample_rock rover4 rover4store waypoint8)
   deleted: (empty rover4store) (at_rock_sample waypoint8)
   added: (have_rock_analysis rover4 waypoint8) (full rover4store)
   goals met: 3 of 10
21. (navigate rover4 waypoint8 waypoint2)
   deleted: (at rover4 waypoint8)
   added: (at rover4 waypoint2)
   goals met: 3 of 10
22. (communicate_rock_data rover4 general waypoint4 waypoint2 waypoint6)
   added: (communicated_rock_data waypoint4)
   goals met: 4 of 10
23. (communicate_rock_data rover4 general waypoint8 waypoint2 waypoint6)
   added: (communicated_rock_data waypoint8)
   goals met: 5 of 10
24. (navigate rover4 waypoint2 waypoint3)
   deleted: (at rover4 waypoint2)
   added: (at rover4 waypoint3)
   goals met: 5 of 10
25. (calibrate rover4 camera4 objective3 waypoint3)
   added: (calibrated camera4 rover4)
   goals met: 5 of 10
26. (take_image rover4 waypoint3 objective1 camera4 colour)
   deleted: (calibrated camera4 rover4)
   added: (have_image rover4 objective1 colour)
   goals met: 5 of 10
27. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 5 of 10
28. (sample_rock rover4 rover4store waypoint3)
   deleted: (empty rover4store) (at_rock_sample waypoint3)
   added: (have_rock_analysis rover4 waypoint3) (full rover4store)
   goals met: 5 of 10
29. (navigate rover4 waypoint3 waypoint2)
   deleted: (at rover4 waypoint3)
   added: (at rover4 waypoint2)
   goals met: 5 of 10
30. (communicate_image_data rover4 general objective1 colour waypoint2 waypoint6)
   added: (communicated_image_data objective1 colour)
   goals met: 6 of 10
31. (communicate_rock_data rover4 general waypoint3 waypoint2 waypoint6)
   added: (communicated_rock_data waypoint3)
   goals met: 7 of 10
32. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 7 of 10
33. (sample_rock rover4 rover4store waypoint2)
   deleted: (empty rover4store) (at_rock_sample waypoint2)
   added: (have_rock_analysis rover4 waypoint2) (full rover4store)
   goals met: 7 of 10
34. (communicate_rock_data rover4 general waypoint2 waypoint2 waypoint6)
   added: (communicated_rock_data waypoint2)
   goals met: 8 of 10
35. (navigate rover4 waypoint2 waypoint6)
   deleted: (at rover4 waypoint2)
   added: (at rover4 waypoint6)
   goals met: 8 of 10
36. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 8 of 10
37. (sample_rock rover4 rover4store waypoint6)
   deleted: (empty rover4store) (at_rock_sample waypoint6)
   added: (have_rock_analysis rover4 waypoint6) (full rover4store)
   goals met: 8 of 10
38. (navigate rover4 waypoint6 waypoint1)
   deleted: (at rover4 waypoint6)
   added: (at rover4 waypoint1)
   goals met: 8 of 10
39. (communicate_rock_data rover4 general waypoint6 waypoint1 waypoint6)
   added: (communicated_rock_data waypoint6)
   goals met: 9 of 10
40. (drop rover4 rover4store)
   deleted: (full rover4store)
   added: (empty rover4store)
   goals met: 9 of 10
41. (sample_rock rover4 rover4store waypoint1)
   deleted: (empty rover4store) (at_rock_sample waypoint1)
   added: (have_rock_analysis rover4 waypoint1) (full rover4store)
   goals met: 9 of 10
42. (communicate_rock_data rover4 general waypoint1 waypoint1 waypoint6)
   added: (communicated_rock_data waypoint1)
   goals met: 10 of 10
